ahtn/keyplus/efm8/src/usb_test.c
    uint8_t index;
    uint16_t length = 0;
    uint8_t *dat;
    USB_Status_TypeDef retVal = USB_STATUS_REQ_ERR;

    if (*((uint8_t *)&setup.bmRequestType) ==
        (USB_SETUP_DIR_D2H | USB_SETUP_TYPE_STANDARD | USB_SETUP_RECIPIENT_DEVICE)
    ) {
        index = setup.wValue & 0xFF;

        switch (setup.wValue >> 8) {
            case USB_DEVICE_DESCRIPTOR: {
                if (index != 0) {
                    break;
                }
                dat = (uint8_t*)&usb_device_desc;
                length = sizeof(usb_device_desc_t);
            } break;

            case USB_CONFIG_DESCRIPTOR: {
                if (index != 0) {
                    break;
                }
                dat = (uint8_t*)&usb_config_desc;
                length = sizeof(usb_config_desc);
            } break;

#if 0
            case USB_STRING_DESCRIPTOR: {
#if (SLAB_USB_NUM_LANGUAGES == 1)

                dat = (SI_VARIABLE_SEGMENT_POINTER(, uint8_t, SI_SEG_GENERIC))stringDescriptors[index];

                // Index 0 is the language string. If SLAB_USB_NUM_LANGUAGES == 1, we
                // know the length will be 4 and the format will be UTF16LE.
                if (index == 0) {
                    length = 4;
                    ep0String.encoding.type = USB_STRING_DESCRIPTOR_UTF16LE;
                }
                // Otherwise, verify the language is correct (either the value set as
                // SLAB_USB_LANGUAGE in usbconfig.h, or 0).
                else if ((setup.wIndex == 0) || (setup.wIndex == SLAB_USB_LANGUAGE)) {
                    // Verify the index is valid
                    if (index < numberOfStrings) {
                        length = *(dat + USB_STRING_DESCRIPTOR_LENGTH);
                        ep0String.encoding.type = *(dat + USB_STRING_DESCRIPTOR_ENCODING);
                        dat += USB_STRING_DESCRIPTOR_LENGTH;
                        ep0String.encoding.init = true;
                    }
                }
#elif (SLAB_USB_NUM_LANGUAGES > 1)

                langSupported = false;

                // Index 0 is the language.
                if (index == 0) {
                    dat = ((SI_VARIABLE_SEGMENT_POINTER(, uint8_t, SI_SEG_GENERIC))stringDescriptors->languageArray[0][index]);
                    length = *((uint8_t *)dat);
                    ep0String.encoding.type = USB_STRING_DESCRIPTOR_UTF16LE;
                } else {
                    // Otherwise, verify the language is one of the supported languages or 0.
                    for (lang = 0; lang < SLAB_USB_NUM_LANGUAGES; lang++) {
                        if ((stringDescriptors->languageIDs[lang] == setup.wIndex)
                            || (stringDescriptors->languageIDs[lang] == 0)
                        ) {
                            langSupported = true;
                            break;
                        }
                    }
                    if ((langSupported == true) && (index < numberOfStrings)) {
                        dat = ((SI_VARIABLE_SEGMENT_POINTER(, uint8_t, SI_SEG_GENERIC))stringDescriptors->languageArray[lang][index]);
                        length = *(dat + USB_STRING_DESCRIPTOR_LENGTH);
                        ep0String.encoding.type = *(dat + USB_STRING_DESCRIPTOR_ENCODING);
                        dat += USB_STRING_DESCRIPTOR_LENGTH;

                        if (ep0String.encoding.type == USB_STRING_DESCRIPTOR_UTF16LE_PACKED) {
                            ep0String.encoding.init = true;
                        } else {
                            ep0String.encoding.init = false;
                        }
                    }
                }
#endif // ( SLAB_USB_NUM_LANGUAGES == 1 )
            } break;
#endif
        }

        // If there is a descriptor to send, get the proper length, then call
        // EP0_Write() to send.
        if (length) {
            // If length != 0, then dat is defined
            if (length > setup.wLength) {
                length = setup.wLength;
            }

            EP0_Write(dat, length);

            retVal = USB_STATUS_OK;
        }
    }

    return retVal;
}


USB_Status_TypeDef USBDCH9_SetupCmd(void) {
    USB_Status_TypeDef status = USB_STATUS_OK;

    switch (setup.bRequest) {
#if 0
        case GET_STATUS:
            status = GetStatus();
            break;

        case CLEAR_FEATURE:
            status = ClearFeature();
            break;

        case SET_FEATURE:
            status = SetFeature();
            break;
#endif

        case SET_ADDRESS:
            status = SetAddress();
            break;

        case GET_DESCRIPTOR:
            status = GetDescriptor();
            break;
#if 0

        case GET_CONFIGURATION:
            status = GetConfiguration();
            break;
#endif

        case SET_CONFIGURATION:
            status = SetConfiguration();
            break;

#if 0
        case GET_INTERFACE:
            status = GetInterface();
            break;

        case SET_INTERFACE:
            status = SetInterface();
            break;
#endif

        default:
            status = USB_STATUS_REQ_ERR;
            break;
    }

    return status;
}

/***************************************************************************//**
 * @brief       Reads data from the USB FIFO to a buffer in generic memory space
 * @param       numBytes
 *              Number of bytes to read from the FIFO
 * @param       dat
 *              Pointer to generic buffer to hold data read from the FIFO
 * @param       fifoNum
 *              USB FIFO to read
 ******************************************************************************/
void USB_ReadFIFO(uint8_t fifoNum, uint8_t numBytes, uint8_t *dat) {
    if (numBytes > 0) {
        USB_EnableReadFIFO(fifoNum);

        // Read the bytes of the FIFO into dat
        while (--numBytes) {
            USB_GetFIFOByte(dat);
            dat++;
        }
        USB_GetLastFIFOByte(dat, fifoNum);

        USB_DisableReadFIFO(fifoNum);
    }
}

