ahtn/keyplus/efm8/src/usb_test.c
    if (USB_Ep0OutPacketReady()) {
        if (ep0.misc.bits.waitForRead == true) {
            ep0.misc.bits.outPacketPending = true;
        } else if (ep0.state == D_EP_IDLE) {
            // ep0String.c = USB_STRING_DESCRIPTOR_UTF16LE;
            USB_ReadFIFOSetup();

            // Vendor unique, Class or Standard setup commands override?
#if SLAB_USB_SETUP_CMD_CB
            retVal = USBD_SetupCmdCb(&setup);

            if (retVal == USB_STATUS_REQ_UNHANDLED) {
#endif
                if (setup.bmRequestType.Type == USB_SETUP_TYPE_STANDARD) {
                    retVal = USBDCH9_SetupCmd();
                }
#if SLAB_USB_SETUP_CMD_CB
            }
#endif

            // Reset index to 0 in case the call to USBD_SetupCmdCb() or
            // USBDCH9_SetupCmd() changed it.
            USB_SetIndex(0);

            // Put the Enpoint 0 hardware into the correct state here.
            if (retVal == USB_STATUS_OK) {
                // If wLength is 0, there is no Data Phase
                // Set both the Serviced Out Packet Ready and Data End bits
                if (setup.wLength == 0) {
                    USB_Ep0SetLastOutPacketReady();
                }
                // If wLength is non-zero, there is a Data Phase.
                // Set only the Serviced Out Packet Ready bit.
                else {
                    USB_Ep0ServicedOutPacketReady();

#if SLAB_USB_SETUP_CMD_CB
                    // If OUT packet but callback didn't set up a USBD_Read and we are expecting a
                    // data byte then we need to wait for the read to be setup and NACK packets until
                    // USBD_Read is called.
                    if ((setup.bmRequestType.Direction == USB_SETUP_DIR_OUT)
                        && (ep0.state != D_EP_RECEIVING)) {
                        ep0.misc.bits.waitForRead = true;
                    }
#endif
                }
            }
            // If the setup transaction detected an error, send a stall
            else {
                SendEp0Stall();
            }
        } else if (ep0.state == D_EP_RECEIVING) {
            handleUsbEp0Rx();
        } else {
            ep0.misc.bits.outPacketPending = true;
        }
    }

    if ((ep0.state == D_EP_TRANSMITTING) && (USB_Ep0InPacketReady() == 0)) {
        handleUsbEp0Tx();
    }
}

static void handleUsbInXInt(uint8_t ep_num) {
    bool callback;
    XRAM USBD_Ep_TypeDef *ep = &epXin[ep_num];

    USB_SetIndex(ep_num);

    if (USB_EpnInGetSentStall()) {
        USB_EpnInClearSentStall();
    } else if (ep->state == D_EP_TRANSMITTING) {
        uint8_t xferred;
        if (ep->remaining > ep->maxPacketSize) {
            xferred = ep->maxPacketSize;
        } else {
            xferred = ep->remaining;
        }

        ep->remaining -= xferred;
        ep->buf += xferred;

        callback = ep->misc.bits.callback;

        // Load more data
        if (ep->remaining > 0) {
            uint8_t num_bytes;
            if (ep->remaining > ep->maxPacketSize) {
                num_bytes = ep->maxPacketSize;
            } else {
                num_bytes = ep->remaining;
            }
            USB_WriteFIFO(ep_num, num_bytes, ep->buf, true);
        } else {
            ep->misc.bits.callback = false;
            ep->state = D_EP_IDLE;
        }
    }
}

#if SLAB_USB_EP3OUT_USED
void handleUsbOut3Int(void) {
    uint8_t count;
    USB_Status_TypeDef status;
    bool xferComplete = false;

    USB_SetIndex(3);

    if (USB_EpnOutGetSentStall()) {
        USB_EpnOutClearSentStall();
    } else if (USB_EpnGetOutPacketReady()) {
        count = USB_EpOutGetCount();

        // If USBD_Read() has not been called, return an error
        if (ep3out.state != D_EP_RECEIVING) {
            ep3out.misc.bits.outPacketPending = true;
            status = USB_STATUS_EP_ERROR;
        } else if (ep3out.remaining < count) {
            // Check for overrun of user buffer
            ep3out.state = D_EP_IDLE;
            ep3out.misc.bits.outPacketPending = true;
            status = USB_STATUS_EP_RX_BUFFER_OVERRUN;
        } else {
            USB_ReadFIFO(3, count, ep3out.buf);

            ep3out.misc.bits.outPacketPending = false;
            ep3out.remaining -= count;
            ep3out.buf += count;

            if ((ep3out.remaining == 0) ||
                (count != SLAB_USB_EP3OUT_MAX_PACKET_SIZE)
            ) {
                ep3out.state = D_EP_IDLE;
                xferComplete = true;
            }

            status = USB_STATUS_OK;
            USB_EpnClearOutPacketReady();
        }

        if (ep3out.misc.bits.callback == true) {
            if (xferComplete == true) {
                ep3out.misc.bits.callback = false;
            }
#if 0
            USBD_XferCompleteCb(EP3OUT, status, count, ep3out.remaining);
#endif
        }
    }
}
#endif

static void handleUsbResetInt(void) {
  // Setup EP0 to receive SETUP packets
  ep0.state = D_EP_IDLE;

  // Halt all other endpoints
#if SLAB_USB_EP1IN_USED
  ep1in.state = D_EP_HALT;
  ep1in.maxPacketSize = SLAB_USB_EP1IN_MAX_PACKET_SIZE;
#endif
#if SLAB_USB_EP2IN_USED
  ep2in.state = D_EP_HALT;
  ep2in.maxPacketSize = SLAB_USB_EP2IN_MAX_PACKET_SIZE;
#endif
#if SLAB_USB_EP3IN_USED
  ep3in.state = D_EP_HALT;
  ep3in.maxPacketSize = SLAB_USB_EP3IN_MAX_PACKET_SIZE;
#endif
#if SLAB_USB_EP1OUT_USED
  ep1out.state = D_EP_HALT;
  ep1out.maxPacketSize = SLAB_USB_EP1OUT_MAX_PACKET_SIZE;
#endif
#if SLAB_USB_EP2OUT_USED
  ep2out.state = D_EP_HALT;
  ep2out.maxPacketSize = SLAB_USB_EP2OUT_MAX_PACKET_SIZE;
#endif
#if SLAB_USB_EP3OUT_USED
  ep3out.state = D_EP_HALT;
  ep3out.maxPacketSize = SLAB_USB_EP3OUT_MAX_PACKET_SIZE;
#endif

  // After a USB reset, some USB hardware configurations will be reset and must
  // be reconfigured.

  // Re-enable clock recovery
#if SLAB_USB_CLOCK_RECOVERY_ENABLED
  USB_EnableFullSpeedClockRecovery();
#endif

  // Re-enable USB interrupts
  USB_EnableSuspendDetection();
  USB_EnableDeviceInts();

  // If the device is bus-powered, always put it in the Default state.
  // If the device is self-powered and VBUS is present, put the device in the
  // Default state. Otherwise, put it in the Attached state.
#if (!SLAB_USB_BUS_POWERED) && \
    (!(SLAB_USB_PWRSAVE_MODE & USB_PWRSAVE_MODE_ONVBUSOFF))
  if (USB_IsVbusOn()) {
    USBD_SetUsbState(USBD_STATE_DEFAULT);
  } else {
    USBD_SetUsbState(USBD_STATE_ATTACHED);
  }
#else
  USBD_SetUsbState(USBD_STATE_DEFAULT);
#endif  // (!(SLAB_USB_PWRSAVE_MODE & USB_PWRSAVE_MODE_ONVBUSOFF))

