ahtn/keyplus/efm8/src/usb_test.c
#if SLAB_USB_RESET_CB
  // Make the USB Reset Callback
  USBD_ResetCb();
#endif
}

#if (SLAB_USB_POLLED_MODE == 0)
void usb_isr(void) __interrupt (USB0_IRQn) {
#else
void usb_isr(void) {
#endif
    uint8_t statusCommon, statusIn, statusOut, indexSave;

#if SLAB_USB_HANDLER_CB
    // Callback to user before processing
    USBD_EnterHandler();
#endif

    // Get the interrupt sources
    statusCommon = USB_GetCommonInts();
    statusIn = USB_GetInInts();
    statusOut = USB_GetOutInts();

#if SLAB_USB_POLLED_MODE
    if ((statusCommon == 0) && (statusIn == 0) && (statusOut == 0)) {
        return;
    }
#endif

    // Save the current index
    indexSave = USB_GetIndex();

    // Check Common USB Interrupts
    if (USB_IsSofIntActive(statusCommon)) {
#if SLAB_USB_SOF_CB
        USBD_SofCb(USB_GetSofNumber());
#endif // SLAB_USB_SOF_CB

        // Check for unhandled USB packets on EP0 and set the corresponding IN or
        // OUT interrupt active flag if necessary.
        if (
            ((ep0.misc.bits.outPacketPending == true) && (ep0.state == D_EP_RECEIVING)) ||
            ((ep0.misc.bits.inPacketPending == true) && (ep0.state == D_EP_TRANSMITTING))
            ) {
            USB_SetEp0IntActive(statusIn);
        }
    }


    // Check USB Endpoint 0 Interrupt
    if (USB_IsEp0IntActive(statusIn)) {
        handleUsbEp0Int();
    }


    // handle IN / OUT endpoint interrupts
#if SLAB_USB_EP3IN_USED
    if (USB_IsIn3IntActive(statusIn)) {
        handleUsbInXInt(3);
    }
#endif  // EP3IN_USED

#if SLAB_USB_EP3OUT_USED
    if (USB_IsOut3IntActive(statusOut)) {
        handleUsbOut3Int();
    }
#endif  // EP3OUT_USED

#if SLAB_USB_EP2IN_USED
    if (USB_IsIn2IntActive(statusIn)) {
        handleUsbInXInt(2);
    }
#endif  // EP2IN_USED

#if SLAB_USB_EP1IN_USED
    if (USB_IsIn1IntActive(statusIn)) {
        handleUsbInXInt(1);
    }
#endif  // EP1IN_USED

#if SLAB_USB_EP2OUT_USED
    if (USB_IsOut2IntActive(statusOut)) {
        handleUsbOut2Int();
    }
#endif  // EP2OUT_USED

#if SLAB_USB_EP1OUT_USED
    if (USB_IsOut1IntActive(statusOut)) {
        handleUsbOut1Int();
    }
#endif  // EP1OUT_USED

    // Restore index
    USB_SetIndex(indexSave);
#if SLAB_USB_HANDLER_CB
    // Callback to user before exiting
    USBD_ExitHandler();
#endif

#if 0

    // Check Common USB Interrupts
    if (USB_IsSofIntActive(statusCommon)) {
#if SLAB_USB_SOF_CB
        USBD_SofCb(USB_GetSofNumber());
#endif // SLAB_USB_SOF_CB

        // Check for unhandled USB packets on EP0 and set the corresponding IN or
        // OUT interrupt active flag if necessary.
        if (((ep0.misc.bits.outPacketPending == true) && (ep0.state == D_EP_RECEIVING)) ||
            ((ep0.misc.bits.inPacketPending == true) && (ep0.state == D_EP_TRANSMITTING)))
        {
            USB_SetEp0IntActive(statusIn);
        }
        // Check for unhandled USB OUT packets and set the corresponding OUT
        // interrupt active flag if necessary.
#if SLAB_USB_EP1OUT_USED
        if ((ep1out.misc.bits.outPacketPending == true) && (ep1out.state == D_EP_RECEIVING))
        {
            USB_SetOut1IntActive(statusOut);
        }
#endif
#if SLAB_USB_EP2OUT_USED
        if ((ep2out.misc.bits.outPacketPending == true) && (ep2out.state == D_EP_RECEIVING))
        {
            USB_SetOut2IntActive(statusOut);
        }
#endif
#if SLAB_USB_EP3OUT_USED
        if ((ep3out.misc.bits.outPacketPending == true) && (ep3out.state == D_EP_RECEIVING))
        {
            USB_SetOut3IntActive(statusOut);
        }
#endif
#if (SLAB_USB_EP3IN_USED && (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_ISOC))
        if ((ep3in.misc.bits.inPacketPending == true) && (ep3in.state == D_EP_TRANSMITTING))
        {
            USB_SetIn3IntActive(statusIn);
        }
#endif
    }

#endif


    if (USB_IsResetIntActive(statusCommon)) {
        handleUsbResetInt();

        // If VBUS is not present on detection of a USB reset, enter suspend mode.
#if (SLAB_USB_PWRSAVE_MODE & USB_PWRSAVE_MODE_ONVBUSOFF)
        if (USB_IsVbusOn() == false) {
            USB_SetSuspendIntActive(statusCommon);
        }
#endif
    }

#if 0
    if (USB_IsResumeIntActive(statusCommon)) {
        handleUsbResumeInt();
    }

    if (USB_IsSuspendIntActive(statusCommon)) {
        handleUsbSuspendInt();
    }
#endif

    return;
}


void USBD_SetUsbState(USBD_State_TypeDef newState)
{

#if (SLAB_USB_SUPPORT_ALT_INTERFACES)
    uint8_t i;
#endif
    USBD_State_TypeDef currentState;

    currentState = s_usb_state;

    // If the device is un-configuring, disable the data endpoints and clear out
    // alternate interface settings
    if ((currentState >= USBD_STATE_SUSPENDED)
        && (newState < USBD_STATE_SUSPENDED)) {
        USBD_AbortAllTransfers();

#if (SLAB_USB_SUPPORT_ALT_INTERFACES)
        for (i = 0; i < SLAB_USB_NUM_INTERFACES; i++) {
            interfaceAltSetting[i] = 0;
        }
#endif
    }
    if (newState == USBD_STATE_SUSPENDED) {
        s_usb_saved_state = currentState;
    }

    s_usb_state = newState;

#if SLAB_USB_STATE_CHANGE_CB
    if (currentState != newState) {
        USBD_DeviceStateChangeCb(currentState, newState);
    }
#endif
}

int8_t USBD_Write(uint8_t epAddr, void *dat, uint16_t byteCount, bool callback) {
    bool usbIntsEnabled;
    XRAM USBD_Ep_TypeDef *ep;

    USB_SaveSfrPage();

    // Verify the endpoint address is valid.
    switch (epAddr) {
        case EP0:
#if SLAB_USB_EP1IN_USED
        case EP1IN:
#endif
#if SLAB_USB_EP2IN_USED
        case EP2IN:
#endif
#if SLAB_USB_EP3IN_USED
        case EP3IN:
#endif
            break;
#if SLAB_USB_EP1OUT_USED
        case EP1OUT:
#endif
#if SLAB_USB_EP2OUT_USED
        case EP2OUT:
#endif
#if SLAB_USB_EP3OUT_USED
        case EP3OUT:
#endif
        default:
            SLAB_ASSERT(false);
            return USB_STATUS_ILLEGAL;
    }

    // If the device is not configured and it is not Endpoint 0, we cannot begin
    // a transfer.
    if ((epAddr != EP0) && (s_usb_state != USBD_STATE_CONFIGURED)) {
        return USB_STATUS_DEVICE_UNCONFIGURED;
    }

    ep = GetEp(epAddr);

    // If the endpoint is not idle, we cannot start a new transfer.
    // Return the appropriate error code.
    if (ep->state != D_EP_IDLE) {
        if (ep->state == D_EP_STALL) {
            return USB_STATUS_EP_STALLED;
        } else {
            return USB_STATUS_EP_BUSY;
        }
    }

