ahtn/keyplus/efm8/src/usb_test.c
    DISABLE_USB_INTS;

    ep->buf = dat;
    ep->remaining = byteCount;
    ep->state = D_EP_TRANSMITTING;
    ep->misc.bits.callback = callback;

    switch (epAddr) {
        // For Endpoint 0, set the inPacketPending flag to true. The USB handler
        // will see this on the next SOF and begin the transfer.
        case (EP0):
            ep0.misc.bits.inPacketPending = true;
            break;

            // For data endpoints, we will call USB_WriteFIFO here to reduce latency
            // between the call to USBD_Write() and the first packet being sent.
#if SLAB_USB_EP1IN_USED
        case (EP1IN):
            USB_WriteFIFO(1,
                (byteCount > SLAB_USB_EP1IN_MAX_PACKET_SIZE) ? SLAB_USB_EP1IN_MAX_PACKET_SIZE : byteCount,
                ep1in.buf,
                true);
            break;
#endif // SLAB_USB_EP1IN_USED
#if SLAB_USB_EP2IN_USED
        case (EP2IN):
            USB_WriteFIFO(2,
                (byteCount > SLAB_USB_EP2IN_MAX_PACKET_SIZE) ? SLAB_USB_EP2IN_MAX_PACKET_SIZE : byteCount,
                ep2in.buf,
                true);
            break;
#endif // SLAB_USB_EP2IN_USED
#if SLAB_USB_EP3IN_USED
        case (EP3IN):
#if  ((SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_BULK) || (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_INTR))
            USB_WriteFIFO(3,
                (byteCount > SLAB_USB_EP3IN_MAX_PACKET_SIZE) ? SLAB_USB_EP3IN_MAX_PACKET_SIZE : byteCount,
                ep3in.buf,
                true);
#elif (SLAB_USB_EP3IN_TRANSFER_TYPE == USB_EPTYPE_ISOC)
            ep3in.misc.bits.inPacketPending = true;
            ep3inIsoIdx = 0;
#endif
            break;
#endif // SLAB_USB_EP3IN_USED
    }

    ENABLE_USB_INTS;
    USB_RestoreSfrPage();

    return USB_STATUS_OK;
}

USB_Status_TypeDef USBD_SetupCmdCb(XRAM USB_Setup_TypeDef *setup) {
    USB_Status_TypeDef retVal = USB_STATUS_REQ_UNHANDLED;

    if ((setup->bmRequestType.Type == USB_SETUP_TYPE_STANDARD)
        && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN)
        && (setup->bmRequestType.Recipient == USB_SETUP_RECIPIENT_INTERFACE))
    {
        // A HID device must extend the standard GET_DESCRIPTOR command
        // with support for HID descriptors.
        switch (setup->bRequest) {
            case GET_DESCRIPTOR: {
                if ((setup->wValue >> 8) == USB_HID_REPORT_DESCRIPTOR) {
                    switch (setup->wIndex) {
                        case INTERFACE_BOOT_KEYBOARD: {
                            USBD_Write(
                                EP0,
                                hid_desc_boot_keyboard,
                                EFM8_MIN(sizeof_hid_desc_boot_keyboard, setup->wLength),
                                false
                            );
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_SHARED_HID: {
                            USBD_Write(
                                EP0,
                                hid_desc_shared_hid,
                                EFM8_MIN(sizeof_hid_desc_shared_hid, setup->wLength),
                                false
                            );
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_VENDOR: {
                            USBD_Write(
                                EP0,
                                hid_desc_vendor,
                                EFM8_MIN(sizeof_hid_desc_vendor, setup->wLength),
                                false
                            );
                            retVal = USB_STATUS_OK;
                        } break;

                        default: // Unhandled Interface
                            break;
                    }
                } else if ((setup->wValue >> 8) == USB_HID_DESCRIPTOR) {
                    switch (setup->wIndex) {
                        case INTERFACE_BOOT_KEYBOARD: {
                            USBD_Write(EP0, &usb_config_desc.hid0,
                                EFM8_MIN(sizeof(usb_hid_desc_t), setup->wLength),
                                false);
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_SHARED_HID: {
                            USBD_Write(EP0, &usb_config_desc.hid1,
                                EFM8_MIN(sizeof(usb_hid_desc_t), setup->wLength),
                                false);
                            retVal = USB_STATUS_OK;
                        } break;

                        case INTERFACE_VENDOR: {
                            USBD_Write(EP0, &usb_config_desc.hid2,
                                EFM8_MIN(sizeof(usb_hid_desc_t), setup->wLength),
                                false);
                            retVal = USB_STATUS_OK;
                        } break;

                        default: // Unhandled Interface
                            break;
                    }
                }
            } break;
        }
    } else if ((setup->bmRequestType.Type == USB_SETUP_TYPE_CLASS)
        && (setup->bmRequestType.Recipient == USB_SETUP_RECIPIENT_INTERFACE)
        && (setup->wIndex == INTERFACE_BOOT_KEYBOARD)
    ) {
        // Implement the necessary HID class specific commands.
        switch (setup->bRequest) {
            case USB_HID_SET_REPORT: {
                if (((setup->wValue >> 8) == 2)               // Output report
                    && ((setup->wValue & 0xFF) == 0)          // Report ID
                    && (setup->wLength == 1)                  // Report length
                    && (setup->bmRequestType.Direction != USB_SETUP_DIR_IN)
                ) {
                    uint8_t tmpBuffer;
                    USBD_Read(EP0, &tmpBuffer, 1, true);
                    retVal = USB_STATUS_OK;
                }
            } break;

            case USB_HID_GET_REPORT: {
                if (((setup->wValue >> 8) == 1)               // Input report
                    && ((setup->wValue & 0xFF) == 0)          // Report ID
                    && (setup->wLength == 8)                  // Report length
                    && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN))
                {
                    // Send an empty (key released) report
                    USBD_Write(EP0,
                        keyboardReport,
                        sizeof(KeyReport_TypeDef),
                        false);
                    retVal = USB_STATUS_OK;
                }
            } break;

