ahtn/keyplus/efm8/src/usb_test.c
#if 0
            // USB by some OS's to set BOOT protocol for keyboard reports
            // allowing the OS to request the device to fall back to 6KRO
            // if it can't handle NKRO reports.
            // However, not all OS's support this, so we can't rely on this
            // to support both 6KRO and NKRO. Instead, we use a different
            // use both a NKRO and 6KRO report as a work around, and
            // use the 6KRO report at boot, and switch to the NKRO later.
            case USB_REQ_HID_SET_PROTOCOL: {
            } break;
            case USB_REQ_HID_GET_PROTOCOL: {
            } break;
#endif

#if 0
            // Technically necessary by USB HID spec, but doesn't seem to be
            // used in practice by most OS's for keyboards
            case USB_HID_SET_IDLE:
                if (((setup->wValue & 0xFF) == 0)             // Report ID
                    && (setup->wLength == 0)
                    && (setup->bmRequestType.Direction != USB_SETUP_DIR_IN))
                {
                    idleTimerSet(setup->wValue >> 8);
                    retVal = USB_STATUS_OK;
                }
                break;

            case USB_HID_GET_IDLE:
                if ((setup->wValue == 0)                      // Report ID
                    && (setup->wLength == 1)
                    && (setup->bmRequestType.Direction == USB_SETUP_DIR_IN))
                {
                    tmpBuffer = idleGetRate();
                    USBD_Write(EP0, &tmpBuffer, 1, false);
                    retVal = USB_STATUS_OK;
                }
                break;
#endif
        }
    }

    return retVal;
}

int8_t USBD_Read(uint8_t epAddr, void *dat, uint16_t byteCount, bool callback) {
    bool usbIntsEnabled;
    XRAM USBD_Ep_TypeDef *ep;

    USB_SaveSfrPage();

    // Verify the endpoint address is valid.
    switch (epAddr) {
        case EP0:
#if SLAB_USB_EP1OUT_USED
        case EP1OUT:
#endif
#if SLAB_USB_EP2OUT_USED
        case EP2OUT:
#endif
#if SLAB_USB_EP3OUT_USED
        case EP3OUT:
#endif
            break;
#if SLAB_USB_EP1IN_USED
        case EP1IN:
#endif
#if SLAB_USB_EP2IN_USED
        case EP2IN:
#endif
#if SLAB_USB_EP3IN_USED
        case EP3IN:
#endif
        default:
            SLAB_ASSERT(false);
            return USB_STATUS_ILLEGAL;
    }

    // If the device has not been configured, we cannot start a transfer.
    if ((epAddr != EP0) && (s_usb_state != USBD_STATE_CONFIGURED)) {
        return USB_STATUS_DEVICE_UNCONFIGURED;
    }

    ep = GetEp(epAddr);

    // If the endpoint is not idle, we cannot start a new transfer.
    // Return the appropriate error code.
    if (ep->state != D_EP_IDLE) {
        if (ep->state == D_EP_STALL) {
            return USB_STATUS_EP_STALLED;
        } else {
            return USB_STATUS_EP_BUSY;
        }
    }

    DISABLE_USB_INTS;

    ep->buf = dat;
    ep->remaining = byteCount;
    ep->state = D_EP_RECEIVING;
    ep->misc.bits.callback = callback;
    ep->misc.bits.waitForRead = false;

    ENABLE_USB_INTS;
    USB_RestoreSfrPage();

    return USB_STATUS_OK;
}
